ycsb/logs/RDMA_BP_8_async_th_28/workloada.log
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
[...]
total zerocopy send size = 0, total send size = 16497878, 0.000000
[OVERALL], RunTime(ms), 4350
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 22988.505747126437
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 42.08984
[READ], MinLatency(us), 22
[READ], MaxLatency(us), 3933
[READ], 95thPercentileLatency(us), 62
[READ], 99thPercentileLatency(us), 76
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4031.0
[CLEANUP], MinLatency(us), 4030
[CLEANUP], MaxLatency(us), 4031
[CLEANUP], 95thPercentileLatency(us), 4031
[CLEANUP], 99thPercentileLatency(us), 4031
total zerocopy send size = 0, total send size = 16514636, 0.000000
total zerocopy send size = 0, total send size = 16493544, 0.000000
[OVERALL], RunTime(ms), 4490
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 22271.714922049
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 43.42255
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 4015
[READ], 95thPercentileLatency(us), 63
[READ], 99thPercentileLatency(us), 77
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3993.0
[CLEANUP], MinLatency(us), 3992
[CLEANUP], MaxLatency(us), 3993
[CLEANUP], 95thPercentileLatency(us), 3993
[CLEANUP], 99thPercentileLatency(us), 3993
[OVERALL], RunTime(ms), 4556
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 21949.078138718174
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 44.17941
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 3945
[READ], 95thPercentileLatency(us), 63
[READ], 99thPercentileLatency(us), 78
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2481.0
[CLEANUP], MinLatency(us), 2480
[CLEANUP], MaxLatency(us), 2481
[CLEANUP], 95thPercentileLatency(us), 2481
[CLEANUP], 99thPercentileLatency(us), 2481
total zerocopy send size = 0, total send size = 16510893, 0.000000
[OVERALL], RunTime(ms), 4551
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 21973.192704900022
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 44.08963
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 4111
[READ], 95thPercentileLatency(us), 64
[READ], 99thPercentileLatency(us), 78
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3861.0
[CLEANUP], MinLatency(us), 3860
[CLEANUP], MaxLatency(us), 3861
[CLEANUP], 95thPercentileLatency(us), 3861
[CLEANUP], 99thPercentileLatency(us), 3861
total zerocopy send size = 0, total send size = 16502733, 0.000000
[OVERALL], RunTime(ms), 4610
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 21691.973969631235
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 44.69682
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 4083
[READ], 95thPercentileLatency(us), 64
[READ], 99thPercentileLatency(us), 78
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2507.0
[CLEANUP], MinLatency(us), 2506
[CLEANUP], MaxLatency(us), 2507
[CLEANUP], 95thPercentileLatency(us), 2507
[CLEANUP], 99thPercentileLatency(us), 2507
total zerocopy send size = 0, total send size = 16497359, 0.000000
[OVERALL], RunTime(ms), 4576
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 21853.146853146853
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 44.31959
[READ], MinLatency(us), 26
[READ], MaxLatency(us), 3973
[READ], 95thPercentileLatency(us), 63
[READ], 99thPercentileLatency(us), 79
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1930.0
[CLEANUP], MinLatency(us), 1930
[CLEANUP], MaxLatency(us), 1930
[CLEANUP], 95thPercentileLatency(us), 1930
[CLEANUP], 99thPercentileLatency(us), 1930
total zerocopy send size = 0, total send size = 16510534, 0.000000
[OVERALL], RunTime(ms), 4683
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 21353.833013025836
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 45.36728
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 3949
[READ], 95thPercentileLatency(us), 64
[READ], 99thPercentileLatency(us), 80
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2289.0
[CLEANUP], MinLatency(us), 2288
[CLEANUP], MaxLatency(us), 2289
[CLEANUP], 95thPercentileLatency(us), 2289
[CLEANUP], 99thPercentileLatency(us), 2289
total zerocopy send size = 0, total send size = 16494766, 0.000000
[OVERALL], RunTime(ms), 5022
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 19912.385503783353
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 48.80907
[READ], MinLatency(us), 20
[READ], MaxLatency(us), 4247
[READ], 95thPercentileLatency(us), 73
[READ], 99thPercentileLatency(us), 94
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2575.0
[CLEANUP], MinLatency(us), 2574
[CLEANUP], MaxLatency(us), 2575
[CLEANUP], 95thPercentileLatency(us), 2575
[CLEANUP], 99thPercentileLatency(us), 2575